// деректива для ввода и вывода данных
#include <iostream> 
// пространсто имен std для удобного написания кода, вместо std:: 
using namespace std;
// главная функция программы
int main () {
    // Установление отображения Русского языка в консоли
    setlocale(LC_ALL, "Russian");
    // объявление переменных 
    double m, n;
     // ввод и вывод в консоль данных с помощью cin и cout
    cout << "Введите m: ";
    cin >> m;
    cout << "Введите n: ";
    cin >> n;
     // объявление переменных 
    double res1, res2, res3;
    // математические операции (результат)
    res1 = n++ * m;
    res2 = n++ < m;
    res3 = m-- > m;
    // вывод результата в консоль 
    cout << "Результат n++ * m = " << res1 << endl;
    cout << "Результат n++ < m = " << res2 << endl;
    cout << "Результат m-- > m = " << res3 << endl;
return 0;
}