 // деректива для ввода и вывода данных
#include <iostream>
// деректива для математических функций
#include <cmath> 
// деректива для форматирования вывода
#include <iomanip>
// пространсто имен std для удобного написания кода, вместо std:: 
using namespace std;
// главная функция программы
int main(){
    // Установление отображения Русского языка в консоли
    setlocale(LC_ALL, "Russian");
    // объявление переменных 
    // int - целое число, double - вещественное число с двойной точностью, float - вещественное число с одинарной точностью
    int a;
    double b1;
    float b2;
    double res11, res13, res1d, res2d; 
    float res12, res1f, res2f;
    // установка точности вывода чисел с плавающей точкой
    cout << setprecision(15);
    // ввод и вывод в консоль данных с помощью cin и cout
    cout << "Введите целое число a: " << "\n";
    cin >> a;
    cout << "Введите вещественное число b: " << "\n";
    cin >> b1;
    // преобразование типа double в float
    b2 = static_cast<float>(b1);
    // математические операции 
    res11 = pow((a + b1), 3);
    res12 = pow((a + b2), 3);
    res13 = pow(a, 3);
    // вывод промежуточного результата в консоль (числитель)
    cout << "Результат double res1 = " << res11 << "\n";
    cout << "Результат float res2 = " << res12 << "\n";
    cout << "Результат res3 = " << res13 << "\n" << "\n";
    // математические операции (числитель)
    res1d = res11 - res13;
    res1f = res12 - res13;
    // вывод прометужочтного результата в консоль (числитель)
    cout << "Результат (double) = " << res1d << "\n";
    cout << "Результат (float) = " << res1f << "\n"<< "\n";
    // математические операции (знаменатель)
    res2d = 3 * a * pow(b1 , 2) + pow(b1, 3) + 3 * pow(a, 2) * b1;
    res2f = 3 * a * pow(b2 , 2) + pow(b2, 3) + 3 * pow(a, 2) * b2;
    // вывод промежуточного результата в консоль (знаменатель)
    cout << "Результат (double) = " << res2d << "\n";
    cout << "Результат (float) = " << res2f << "\n"<< "\n";
    // математические операции (результат)
    res2d = res1d / res2d;
    res2f = res1f / res2f;
    // вывод промежуточного результата в консоль (результат)
    cout << "Результат (double) = " << res2d << "\n";
    cout << "Результат (float) = " << res2f << "\n";
return 0;
}